import { getLogger as getLogtapeLogger, configure, getConsoleSink } from '@logtape/logtape'

export const LOGGER_CATEGORY = 'ready2take2';

export function getLogger(...categories: string[]) {
    return getLogtapeLogger([LOGGER_CATEGORY, ...categories]);
}

export async function configureLogger() {
    await configure({
        sinks: { console: getConsoleSink() },
        loggers: [
            { category: ["logtape", "meta"], lowestLevel: 'warning', sinks: ["console"] },
            { category: 'ready2take2', lowestLevel: 'debug', sinks: ['console'] },
        ]
    })
}

export function banner(port: number) {
    console.log(
`██████╗ ███████╗ █████╗ ██████╗ ██╗   ██╗██████╗ 
██╔══██╗██╔════╝██╔══██╗██╔══██╗╚██╗ ██╔╝╚════██╗
██████╔╝█████╗  ███████║██║  ██║ ╚████╔╝  █████╔╝
██╔══██╗██╔══╝  ██╔══██║██║  ██║  ╚██╔╝  ██╔═══╝ 
██║  ██║███████╗██║  ██║██████╔╝   ██║   ███████╗
╚═╝  ╚═╝╚══════╝╚═╝  ╚═╝╚═════╝    ╚═╝   ╚══════╝
                                                 
████████╗ █████╗ ██╗  ██╗███████╗██████╗         
╚══██╔══╝██╔══██╗██║ ██╔╝██╔════╝╚════██╗        
   ██║   ███████║█████╔╝ █████╗   █████╔╝        
   ██║   ██╔══██║██╔═██╗ ██╔══╝  ██╔═══╝         
   ██║   ██║  ██║██║  ██╗███████╗███████╗        
   ╚═╝   ╚═╝  ╚═╝╚═╝  ╚═╝╚══════╝╚══════╝        


`);

console.log(`Web UI: http://localhost:${port}/`)
}
